{"title":"Development History","description":"Our growth journey in the field of digital solutions","milestones":[{"id":"0","year":"2010","label":"Beginning","title":"Company Establishment","content":"The company was established in Shanghai, focusing on providing digital transformation solutions for enterprises. The founding team consisted of five senior technical experts, adhering to the philosophy of 'technology drives the future', dedicated to solving enterprise pain points with innovative technology."},{"id":"1","year":"2013","label":"Expansion","title":"Business Growth","content":"Completed Series A financing, expanding business from Shanghai to Beijing, Guangzhou and other first-tier cities. The R&D team expanded to 50 people, launching Enterprise Digital Management Platform 1.0, which gained recognition and adoption from many well-known enterprise clients."},{"id":"2","year":"2016","label":"Innovation","title":"Technical Breakthrough","content":"Developed an AI-based enterprise decision support platform, becoming an industry-leading technology innovator. Established an R&D center in Hangzhou, focusing on AI algorithms and big data analysis technology research, obtaining multiple technology patents, and establishing the company's technological leadership in the industry."},{"id":"3","year":"2019","label":"Upgrade","title":"Strategic Enhancement","content":"Completed Series B financing, upgrading the company's strategy to a comprehensive digital solution provider. Integrated cloud computing, big data, artificial intelligence and other technologies to launch Enterprise Digital Panorama Platform 2.0, providing customized digital transformation solutions for clients across various industries."},{"id":"4","year":"2023","label":"Leadership","title":"Comprehensive Development","content":"Established branches in major cities nationwide, with team size exceeding 500 people. Launched international business department, beginning to export digital solutions to overseas markets. Established industry-university-research cooperation relationships with multiple universities to jointly promote industry technology innovation and talent development."},{"id":"5","year":"2025","label":"Future","title":"Vision","content":"Continuing our innovation journey"}]}